In [2]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a','b','c'] #list
data = [10,20,30] #list
arr = np.array(data) #array
d = {'a':10, 'b':20, 'c':30} #dictionary

In [4]:
pd.Series(data=data)

0    10
1    20
2    30
dtype: int64

In [5]:
#in pandas Series, you can specify what the index can be
pd.Series(data=data, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
#since data and labels come in this order, we dont need to put names
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
#series can print any object. e.g. you can pass in builtin functions.
pd.Series(data=[sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [10]:
ser1=pd.Series([1,2,3,4], ['USA','GERMANY','JAPAN','USSR'])
ser1

USA        1
GERMANY    2
JAPAN      3
USSR       4
dtype: int64

In [11]:
ser2=pd.Series([1,2,5,4],['USA','GERMANY','ITALY','USSR'])
ser2

USA        1
GERMANY    2
ITALY      5
USSR       4
dtype: int64

In [12]:
ser3=ser1+ser2
ser3

GERMANY    4.0
ITALY      NaN
JAPAN      NaN
USA        2.0
USSR       8.0
dtype: float64

In [13]:
#dataframes are the workhorse of pandas
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(4,4),['A','B','C','D'], ['E','F','G','H'])
df

          E         F         G         H
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [14]:
df['E']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: E, dtype: float64

In [15]:
df['E']['C']

-2.018168244037392

In [16]:
type(df['F'])

pandas.core.series.Series

In [17]:
type(df['E']['C'])

numpy.float64

In [18]:
df

          E         F         G         H
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
#how to add a new column to your dataframe
#use arithmetic to pull off a new column
df['new'] = df['E'] + df['G']
df

          E         F         G         H       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [20]:
#how to drop a column
#this will not drop a column from the df
df.drop('new',axis=1)

          E         F         G         H
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [21]:
#to drop a column from the actual dataframe, use the argument inplace
df['new'] = df['E'] + df['G']
df.drop('new',axis=1,inplace=True)

In [22]:
df

          E         F         G         H
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
#to drop a row, use axis=0
df.drop('D',axis=0,inplace=True)
df

          E         F         G         H
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [24]:
#why is this difference of axis?
df.shape
#shows rows and columns in that order. that is why when you have to delete a row, you need to use axis=0 and when you have
#to delete a column, you have to use axis=1

(3, 4)

In [25]:
#how to select rows in pandas dataframe
#pass in a row name
df.loc['A']
#pass in a index location
df.iloc[2]

E   -2.018168
F    0.740122
G    0.528813
H   -0.589001
Name: C, dtype: float64

In [26]:
#rows and columns in a dataframe are a Series object
type(df.loc['A'])

pandas.core.series.Series

In [27]:
#select a subset of data
#row and column
df.loc[['A','C'],['E','G']]

          E         G
A  2.706850  0.907969
C -2.018168  0.528813

In [28]:
#conditional selection and multi index selection
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['F','G','H','I'])
df

          F         G         H         I
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
#conditional selection
df > 0

       F      G      H      I
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [30]:
booldf = df > 0
booldf

       F      G      H      I
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [31]:
df[booldf]

          F         G         H         I
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
#combine this together
df[df > 0]

          F         G         H         I
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df[df['F'] > 0]

          F         G         H         I
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df[( df['F'] > 0 ) & ( df['H'] > 0)]

          F         G         H         I
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [36]:
#resetting the index
df

          F         G         H         I
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.reset_index() #your old index will become a column in your dataframe

  index         F         G         H         I
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [38]:
newindx = 'NY NJ FL OR TX'.split()
newindx

['NY', 'NJ', 'FL', 'OR', 'TX']

In [39]:
df['States'] = newindx
df

          F         G         H         I States
A  2.706850  0.628133  0.907969  0.503826     NY
B  0.651118 -0.319318 -0.848077  0.605965     NJ
C -2.018168  0.740122  0.528813 -0.589001     FL
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     TX

In [41]:
#multi index and index hierarchy
# index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2' ]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [43]:
 df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [45]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [46]:
df.index.names

FrozenList([None, None])

In [47]:
df.index.names=['Groups', 'Numbers']
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [48]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [49]:
df.loc['G1'].loc[2]['A']

-1.7060859307350775

In [50]:
#cross section - you want to grab items listed under 1 under both groups G1 and G3
df.xs(1,level='Numbers')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [51]:
#how to deal with missing data
#when you have data, pandas automatically fills in Nan for this
import numpy as np
import pandas as pd

In [52]:
d = {'A': [1,2,np.nan], 'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
#you may want to drop missing values from your datasets
df.dropna()
#pandas will drop all rows that have Nan. This works on axis=0 by default.

     A    B  C
0  1.0  5.0  1

In [54]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [58]:
df
# give threshold
df.dropna(axis=0,thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [59]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [60]:
#you can fill in a value which is mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame( data )
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [4]:
byCompany = df.groupby('Company')
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [5]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [6]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [8]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [9]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [10]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [11]:
#merging, joining and concatenating dataframes
import numpy as np
import pandas as pd

In [12]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0','B1','B2','B3'],
                   'C': ['C0','C1','C2','C3'],
                   'D': ['D0','D1','D2','D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4','B5','B6','B7'],
                   'C': ['C4','C5','C6','C7'],
                   'D': ['D4','D5','D6','D7']},
                  index = [4,5,6,7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8','B9','B10','B11'],
                   'C': ['C8','C9','C10','C11'],
                   'D': ['D8','D9','D10','D11']},
                  index = [8,9,10,11])

In [13]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [14]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [15]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [17]:
#it is concatenating on axis = row by default
pd.concat([df1,df2,df3],axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [18]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [19]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df['col2'].unique() # returns a numpy array of unique values in a given column

array([444, 555, 666])

In [21]:
df['col2'].nunique()

3

In [22]:
#how many times each value appears in a given column
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
#selecting data from a dataframe